---
kind: enumMember
id: F:Autodesk.Revit.DB.Visibility.Highlight
enum: Autodesk.Revit.DB.Visibility
source: html/0927cebc-d2fc-3411-26d7-1927f3b68e09.htm
---
# Autodesk.Revit.DB.Visibility.Highlight

The geometry object is visible, but is affected by highlight or prehighlight special coloration.
This type of geometry is returned by Geometry[Options]
if IncludeNonVisibleObjects is true.